/*Цель работы: 
реализовать алгоритмы обработки графовых структур: 

1.поиск различных путей, 
2.проверка связности, 
3.построение остовых деревьев минимальной стоимости.

Обработать графовую структуру в соответствии с указанным вариантом задания. 
Обосновать выбор необходимого алгоритма и выбор структуры для представления графов. 
Ввод данных – на усмотрение программиста. Результат выдать в графической форме.*/

/*Задан граф - не дерево. Проверить, можно ли превратить его в дерево удалением одной вершины вместе с ее ребрами.*/

#include <stdio.h>
#include <stdlib.h>

#include "main.h"

int main(void)
{
	printf("OK\n");

	return 0;

}